YoungSooBae1224/SensorShield-EVK-003-nRF52/KXTJ3_1057/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Initialize clock driver.*/
void nrf52_clock_init(void) {

    ret_code_t err_code;
    err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function poiters to platform spesific functionality*/
void nrf52_platform_functions_init(void) {
  
    nrf52_funcs.twi_write     = nrf52_twi_write;
    nrf52_funcs.twi_read      = nrf52_twi_read;    
    nrf52_funcs.delay_ms      = nrf52_delay_ms;
    nrf52_funcs.debug_println = nrf52_debug_println;
}

/** @brief Handling application events from the scheduler. */
void application_event_handler(void * p_event_data, uint16_t event_size)
{
    uint8_t size;
    ret_code_t ret;
    uint8_t data[MAX_SENSOR_DATA_SIZE];
    int16_t data_16[3] = {0,};
    float Accel[3] = {0.0,};

    app_internal_evt_t *event = (app_internal_evt_t*)p_event_data;
    if(event->type == EVENT_READ_TWI) {
        ret = event->app_events.sensor_evt.sensor_read(data, &size);
        if (ret == NRF_SUCCESS) {            
            /* Add sensor ID check here for passing certain sensor data to USB or BLE*/
            if(event->app_events.sensor_evt.sensor_id == KXTJ3_1057_ID) {
                char tr_data[256] = {0,};
                char x_char[20] = {0,};
                char y_char[20] = {0,};
                char z_char[20] = {0,};

                data_16[0] = data[0]|data[1]<<8;
                data_16[1] = data[2]|data[3]<<8;
                data_16[2] = data[4]|data[5]<<8;

                Accel[0] = (float)data_16[0]*9.8/GDivide;
                Accel[1] = (float)data_16[1]*9.8/GDivide;
                Accel[2] = (float)data_16[2]*9.8/GDivide;

                sprintf(x_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT(Accel[0]));
                sprintf(y_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT(Accel[1]));
                sprintf(z_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT(Accel[2]));

                sprintf(tr_data,"%s/%s/%s",x_char,y_char,z_char);
                NRF_LOG_INFO("%s",NRF_LOG_PUSH(tr_data));

                int cnt;
                for(cnt = 0 ; cnt < 256 ; cnt++)
                {
                    if(tr_data[cnt] == 0)
                    {
                        break;
                    }
                }
                ble_uart_tx((uint8_t *)tr_data, cnt);
            }
        }
    }
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    // Initialize.
    log_init();
    nrf52_clock_init();
    timers_init();
    nrf52_gpiote_init();

    /*Init scheduler, context swich from ISR to main.*/
    scheduler_init();
    
    buttons_leds_init(&erase_bonds);
    nrf52_twi_init();
    nrf52_platform_functions_init();
    sensors_init(&nrf52_funcs);

    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Magneto Sensor application start.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();
        idle_state_handle();
    }
}


/**
 * @}
 */
